Tekla.Structures.ModelInternal.RebarLegSurfaceObject
The RebarLegSurfaceObject class represents a polymesh surface for generating rebar legs in a Tekla.Structures.ModelInternal.RebarLegSurfaceObject.RebarSet.
using Tekla.Structures.Model;
using Tekla.Structures.Geometry3d;
public class Example
{
public void Example1(Vector[] vertices, int[][] outerWires, IDictionary<int, int[][]> innerWires)
{
var beam = new Beam();
// Set Beam properties (code omitted)...
beam.Insert();
var rebarSet = new RebarSet();
// Set RebarSet properties (code omitted)...
rebarSet.Insert();
var legSurface = new RebarLegSurfaceObject();
legSurface.Polymesh = new FacetedBrep(vertices, outerWires, innerWires);
legSurface.Father = beam;
legSurface.RebarSet = rebarSet;
legSurface.LayerNumber = 1;
legSurface.AdditionalOffset = 25.0;
legSurface.Insert();
}
}

Tekla.Structures.ModelInternal.RebarLegSurfaceObject.#ctor
Initializes a new instance of the Tekla.Structures.ModelInternal.RebarLegSurfaceObject class.

Tekla.Structures.ModelInternal.RebarLegSurfaceObject.RebarSet
Gets or sets the Tekla.Structures.ModelInternal.RebarLegSurfaceObject.RebarSet to which the leg surface object belongs.

Tekla.Structures.ModelInternal.RebarLegSurfaceObject.LayerNumber
Gets or sets the layer number of the leg surface object.

Tekla.Structures.ModelInternal.RebarLegSurfaceObject.AdditionalOffset
Gets or sets the user defined offset of the rebar legs from the leg surface object.

Tekla.Structures.ModelInternal.RebarLegSurfaceObject.Insert
Inserts the leg surface object into the model database.
Returns: True if successful, otherwise false.

Tekla.Structures.ModelInternal.RebarLegSurfaceObject.Select
Selects the leg surface object from the model database. The identifier must be set.
Returns: True if successful, otherwise false.

Tekla.Structures.ModelInternal.RebarLegSurfaceObject.Modify
Modifies the existing leg surface object in the model database to match the current one.
Returns: True if successful, otherwise false.

Tekla.Structures.ModelInternal.RebarLegSurfaceObject.ToStruct(Tekla.Structures.ModelInternal.dotLegSurfaceObject_t@)
Converts this instance to a struct.
output: The output parameter.

Tekla.Structures.ModelInternal.RebarLegSurfaceObject.FromStruct(Tekla.Structures.ModelInternal.dotLegSurfaceObject_t@)
Sets the properties of this instance from the struct.
input: The input parameter.